{
"namesOfAlluh":[
 {
  "nameOfAllah": "الرَّحْمن",
  "en": "Ar-Rahmān",
  "meaning ": "رحمته عز وجل وسعت كل شيء وهو أرحم الراحمين"
 },
 {
  "nameOfAllah": "الرَّحِيم",
  "en": "Ar-Rahīm",
  "meaning ": "المنعم أبدا، المتفضل دوما، فرحمته لا تنتهي"
 },
 {
  "nameOfAllah": "المَلِك",
  "en": "Al-Malik",
  "meaning ": "المتصرف بملكه كيف يشاءفهو المالك المطلق. الله، ملك الملوك، له الملك، وهو مالك يوم الدين، ومليك الخلق"
 },
 {
  "nameOfAllah": "الْقُدُّوس",
  "en": "Al-Quddūs",
  "meaning ": "الطاهر المنزه عن العيوب والنقائص وعن كل ما تحيط به العقول."
 },
 {
  "nameOfAllah": "السَّلَام",
  "en": "As-Salām",
  "meaning ": "ناشر السلام بين الأنام وهو الذي سلمت ذاته من النقص والعيب والفناء."
 },
 {
  "nameOfAllah": "المُؤْمِن",
  "en": "Al-Mu'min",
  "meaning ": "المؤمِّن لخلقه من العذاب والخوف، والذي يصدق عباده ما وعدهم."
 },
 {
  "nameOfAllah": "الْمُهَيْمِن",
  "en": "Al-Muhaymin",
  "meaning ": "الرقيب الحافظ لكل شيء، القائم على خلقه بأعمالهم، وأرزاقهم وآجالهم، والمطلع على خفايا الأمور وخبايا الصدور."
 },
 {
  "nameOfAllah": "الْعَزِيز",
  "en": "Al-‘Azīz",
  "meaning ": "المنفرد بالعزة، الظاهر الذي لا يقهر، القوي الممتنع فلا يغلبه شيء وهو غالب كل شيء."
 },
 {
  "nameOfAllah": "الْجَبَّار",
  "en": "Al-Jabbār",
  "meaning ": "الذي تنفذ مشيئته، ولا يخرج أحد عن تقديره، وهو القاهر لخلقه على ما أراد."
 },
 {
  "nameOfAllah": "الْمُتَكَبِّر",
  "en": "Al-Mutakabbir",
  "meaning ": "صاحب الذات العظيمة. المتعالى عن صفات الخلق المنفرد بالعظمة والكبرياء."
 },
 {
  "nameOfAllah": "الْخَالِق",
  "en": "Al-Khāliq",
  "meaning ": "من يخلق كافة الموجودات في الكونالفاطر المبدع لكل شيء، والمقدر له والموجد للأشياء من العدم، فهو خالق كل صانع وصنعته."
 },
 {
  "nameOfAllah": "الْبَارِئ",
  "en": "Al-Bāri",
  "meaning ": "خلق الخلق بقدرته لا عن مثال سابق، القادر على إبراز ما قدره إلى الوجود."
 },
 {
  "nameOfAllah": "الْمُصَوِّر",
  "en": "Al-Muṣawwir",
  "meaning ": "صور جميع الموجودات، ورتبها فأعطى كل شيء منها صورة خاصة، وهيئة منفردة، يتميز بها على اختلافها وكثرتها."
 },
 {
  "nameOfAllah": "اَلْغَفَّار",
  "en": "Al-Ghaffār",
  "meaning ": "وحده الذي يغفر الذنوب ويستر العيوب في الدنيا والآخرة."
 },
 {
  "nameOfAllah": "الْقَهَّار",
  "en": "Al-Qahhār",
  "meaning ": "الغالب الذي قهر خلقه بسلطانه وقدرته، وخضعت له الرقاب وذلت له الجبابرة، وصرف خلقه على ما أراد طوعا وكرها، وعنت الوجوه له."
 },
 {
  "nameOfAllah": "الْوَهَّاب",
  "en": "Al-Wahhāb",
  "meaning ": "المنعم على العباد، الذي يهب بغير عوض ويعطي الحاجة بغير سؤال، كثير النعم، دائم العطاء."
 },
 {
  "nameOfAllah": "الرَّزَّاق",
  "en": "Ar-Razzāq",
  "meaning ": "خلق الأرزاق وأعطى كل الخلائق أرزاقها، ويمد كل كائن لما يحتاجه، ويحفظ عليه حياته ويصلحه."
 },
 {
  "nameOfAllah": "الْفَتَّاح",
  "en": "Al-Fattāḥ",
  "meaning ": "يفتح مغلق الأمور، ويسهل العسير، وبيده مفاتيح السماوات والأرض"
 },
 {
  "nameOfAllah": "الْعَلِيم",
  "en": "Al-'Alīm",
  "meaning ": "يعلم تفاصيل الأمور، ودقائق الأشياء وخفايا الضمائر، والنفوس، لا يعزب عنه مثقال ذرة، فعلمه يحيط بجميع الأشياء."
 },
 {
  "nameOfAllah": "الْقَابِضُ",
  "en": "Al-Qābiḍ",
  "meaning ": "يقبض الرزق عمن يشاء من الخلق بعدله وحكمته"
 },
 {
  "nameOfAllah": "الْبَاسِطُ",
  "en": "Al-Bāsiṭ",
  "meaning ": "يوسع الرزق لمن يشاء من عباده بجوده ورحمته"
 },
 {
  "nameOfAllah": "الخَافِض",
  "en": "Al-Khāfiḍ",
  "meaning ": "يخفض الأذلال لكل من طغى وتجبر وخرج على شريعته وتمرد"
 },
 {
  "nameOfAllah": "الرَّافِعُ",
  "en": "Ar-Rāfi'",
  "meaning ": "يرفع عباده المؤمنين بالطاعات ويرفعهم على عدوهم فينصرهم وهو رافع السماوات السبع."
 },
 {
  "nameOfAllah": "المُعِز",
  "en": "Al-Mu'izz",
  "meaning ": "يرفع شأن من تمسك بدينه. يهب القوة والغلبة والشدة لمن شاء فيعزه."
 },
 {
  "nameOfAllah": "المُذِل",
  "en": "Al-Mudhill",
  "meaning ": "يذل الأعداء والعاصين. ينزع القوة والغلبة والشدة عمن يشاء فيذله."
 },
 {
  "nameOfAllah": "السَّمِيعُ",
  "en": "As-Samī'",
  "meaning ": "سمعه لجميع الأصوات الظاهرة والباطنة الخفية والجلية، وإحاطته التامة بها، ومعناه أيضًا: سمع الإجابة منه للسائلين والداعين والعابدين فيجيبهم ويثيبهم."
 },
 {
  "nameOfAllah": "الْبَصِير",
  "en": "Al-Baṣīr",
  "meaning ": "يرى الأشياء كلها ظاهرها وباطنها وهو المحيط بكل شيء علماً."
 },
 {
  "nameOfAllah": "الْحَكَم",
  "en": "Al-Ḥakam",
  "meaning ": "يفصل بين مخلوقاته بما شاء ويفصل بين الحق والباطل لا راد لقضائه ولا معقب لحكمه."
 },
 {
  "nameOfAllah": "العَدْل",
  "en": "Al-'Adl",
  "meaning ": "حرم الظلم على نفسه، وجعله على عباده محرما، فهو المنزه عن الظلم والجور في أحكامه وأفعاله الذي يعطي كل ذي حق حقه."
 },
 {
  "nameOfAllah": "اللَّطِيفُ",
  "en": "Al-Laṭīf",
  "meaning ": "البر الرفيق بعباده، يرزق وييسر ويحسن إليهم، ويرفق بهم ويتفضل عليهم."
 },
 {
  "nameOfAllah": "الْخَبِيرُ",
  "en": "Al-Khabīr",
  "meaning ": "العليم بدقائق الأمور، لا تخفى عليه خافية، ولا يغيب عن علمه شيء فهو العالم بما كان ويكون"
 },
 {
  "nameOfAllah": "الْحَلِيمُ",
  "en": "Al-Ḥalīm",
  "meaning ": "الصبور الذي يمهل ولا يهمل، ويستر الذنوب، ويؤخر العقوبة، فيرزق العاصي كما يرزق المطيع."
 },
 {
  "nameOfAllah": "الْعَظِيمُ",
  "en": "Al-'Aẓīm",
  "meaning ": "لعظيم في كل شئ، عظيم في ذاته وأسمائه وصفاته، عظيم في رحمته، عظيم في قدرته، عظيم في حكمته، عظيم في جبروته وكبريائه، عظيم في هبته وعطائه، عظيم في خبرته ولطفه، عظيم في بره وإحسانه، عظيم في عزته وعدله وحمده، فهو العظيم المطلق، فلا أحد يساويه، ولاعظيم يدانيه."
 },
 {
  "nameOfAllah": "الْغَفُورُ",
  "en": "Al Ghafūr",
  "meaning ": "الساتر لذنوب عباده المتجاوز عن خطاياهم وذنوبهم. الفرق بين هذا الاسم واسم الغفار أن اسم الغفور يكون للدلالة على مغفرة الذنب مهما عظم وأيس صاحبه من المغفرة أما الغفار فتدل على مغفرة الله المستمرة للذنوب المختلفة لأن الإنسان خطاء فالله غفار."
 },
 {
  "nameOfAllah": "الشَّكُورُ",
  "en": "Ash-Shakūr",
  "meaning ": "يزكو عنده القليل من أعمال العباد، فيتقبلها ويضاعف أجرها."
 },
 {
  "nameOfAllah": "الْعَلِيُّ",
  "en": "Al-'Alīy",
  "meaning ": "الرفيع القدر فلا يحيط به وصف الواصفين المتعالي عن الأنداد والأضداد، فكل معاني العلو ثابتة له ذاتا وقهرا وشأنا."
 },
 {
  "nameOfAllah": "الْكَبِيرُ",
  "en": "Al-Kabīr",
  "meaning ": "لا تستطيع الحواس والعقول إدراكه. العظيم الجليل ذو الكبرياء في صفاته وأفعاله فلا يحتاج إلى شيء ولا يعجزه شيء (ليس كمثله شيء)."
 },
 {
  "nameOfAllah": "الْحَفِيظُ",
  "en": "Al-Ḥafīẓ",
  "meaning ": "يحفظ الكون والعباد، ونظامهم، و الأعمال من أجل الحساب. لا يغرب عن حفظه شيء ولو كمثقال الذر فحفظه لا يتبدل ولا يزول ولا يعتريه التبديل."
 },
 {
  "nameOfAllah": "المُقِيت",
  "en": "Al-Muqīt",
  "meaning ": "المتكفل بإيصال أقوات الخلق إليهم وهو الحفيظ والمقتدر والقدير والمقدر والممدد."
 },
 {
  "nameOfAllah": "الْحَسِيبُ",
  "en": "Al-Ḥasīb",
  "meaning ": "الكافي الذي منه كفاية العباد وهو الذي عليه الاعتماد يكفي العباد بفضله."
 },
 {
  "nameOfAllah": "الجَلِيل",
  "en": "Al-Jalīl",
  "meaning ": "العظيم المطلق المتصف بجميع صفات الكمال والمنعوت بكمالها المنزه عن كل نقص."
 },
 {
  "nameOfAllah": "الْكَرِيمُ",
  "en": "Al-Karīm",
  "meaning ": "الكثير الخير الجواد المعطي الذي لا ينفذ عطاؤه وهو الكريم المطلق الجامع لأنواع الخير والشرف والفضائل المحمود بفعاله."
 },
 {
  "nameOfAllah": "الرَّقِيبُ",
  "en": "Ar-Raqīb",
  "meaning ": "الرقيب الذي يراقب أحوال العباد ويعلم أقوالهم ويحصي أعمالهم وهو الحافظ الذي لا يغيب عنه شيء."
 },
 {
  "nameOfAllah": "الْمُجِيبُ",
  "en": "Al-Mujīb",
  "meaning ": "يجيب دعاء من دعاه، وسؤال من سأله، ويقابله بالعطاء والقبول، ولا يسأل أحد سواه."
 },
 {
  "nameOfAllah": "الْوَاسِعُ",
  "en": "Al-Wāsi'",
  "meaning ": "وسع رزقه جميع خلقه، عمت رحمته كل شيء و وسع علمه كل شيء."
 },
 {
  "nameOfAllah": "اَلْحَكِيمُ",
  "en": "Al-Ḥakīm",
  "meaning ": "لمحق في تدبيره اللطيف في تقديره الخبير بحقائق الأمور العليم بحكمه المقدور فجميع خلقه وقضاه خير وحكمة وعدل."
 },
 {
  "nameOfAllah": "الْوَدُودُ",
  "en": "Al-Wadūd",
  "meaning ": "المحسن و المحب لعباده، والمحبوب في قلوب أوليائه."
 },
 {
  "nameOfAllah": "الْمَجِيدُ",
  "en": "Al-Majīd",
  "meaning ": "وصف نفسه بالمجيد وهو متضمن كثرة صفات كماله وسعتها، وعدم إحصاء الخلق لها، وسعة أفعاله وكثرة خيره ودوامه. وتعني أيضاً البالغ النهاية في المجد، الكثير الإحسان الجزيل العطاء العظيم البر."
 },
 {
  "nameOfAllah": "البَاعِث",
  "en": "Al-Bā'ith",
  "meaning ": "باعث الخلق يوم القيامة، وباعث رسله و أنبيائه إلى العباد، وباعث المعونة إلى العبد."
 },
 {
  "nameOfAllah": "الشَّهِيدُ",
  "en": "Ash-Shahīd",
  "meaning ": "الحاضر الذي لا يغيب عنه شيء، فهو المطلع على كل شيء مشاهد له عليم بتفاصيله."
 },
 {
  "nameOfAllah": "الْحَقُّ",
  "en": "Al-Ḥaqq",
  "meaning ": "يحق الحق بكلماته ويؤيد أولياءه فهو المستحق للعبادة."
 },
 {
  "nameOfAllah": "الْوَكِيلُ",
  "en": "Al-Wakīl",
  "meaning ": "الكفيل بالخلق القائم بأمورهم فمن توكل عليه تولاه وكفاه، ومن استغنى به أغناه وأرضاه."
 },
 {
  "nameOfAllah": "الْقَوِيّ",
  "en": "Al-Qawwīy",
  "meaning ": "صاحب القدرة التامة البالغة الكمال غالب لا يُغلب فقوته فوق كل قوة، ولايرد قضاءه راد، ينفذ أمره، ويمضي قضاؤه في خلقه، شديد عقابه لمن كفر بآياته وجحد حججه."
 },
 {
  "nameOfAllah": "الْمَتِينُ",
  "en": "Al-Matīn",
  "meaning ": "الشديد الذي لا يحتاج في إمضاء حكمه إلى جند أو مدد ولا إلى معين، فهو المتناهي في القوة، التي لاتلحق أفعاله مشقة، ولايمسه فيها لغوب."
 },
 {
  "nameOfAllah": "الْوَلِيُّ",
  "en": "Al-Walīy",
  "meaning ": "لمحب الناصر لمن أطاعه، ينصر أولياءه، ويقهر أعداءه، والمتولي الأمور الخلائق ويحفظهم."
 },
 {
  "nameOfAllah": "الْحَمِيدُ",
  "en": "Al-Ḥamīd",
  "meaning ": "المستحق للحمد والثناء له منتهى الحمد وأطيبه على ذاته وصفاته وعلى نعمه التي لا تحصى."
 },
 {
  "nameOfAllah": "الْـمُحْصِي",
  "en": "Al-Muḥṣīy",
  "meaning ": "أحصى كل شيء بعلمه، فلا يفوته منها دقيق ولا جليل."
 },
 {
  "nameOfAllah": "المُبدِئ",
  "en": "Al-Mubdi'",
  "meaning ": "هو الذي أنشأ الأشياء، واخترعها ابتداء من غير سابق مثال."
 },
 {
  "nameOfAllah": "المُعِيد",
  "en": "Al-Mu'īd",
  "meaning ": "يعيد الخلق بعد الحياة إلى الممات في الدنيا، وبعد الممات إلى الحياة يوم القيامة."
 },
 {
  "nameOfAllah": "المُحيِي",
  "en": "Al-Muḥyīy",
  "meaning ": "خالق الحياة ومعطيها لمن شاء، يحيي الخلق من العدم ثم يحييهم بعد الموت."
 },
 {
  "nameOfAllah": "المُمِيت",
  "en": "Al-Mumīt",
  "meaning ": "مقدر الموت على كل من أماته ولا مميت سواه، قهر عباده بالموت متى شاء وكيف شاء."
 },
 {
  "nameOfAllah": "الْحَيُّ",
  "en": "Al-Ḥayy",
  "meaning ": "المتصف بالحياة الأبدية التي لا بداية لها ولا نهاية فهو الباقي أزلا وأبدا وهو الحي الذي لا يموت."
 },
 {
  "nameOfAllah": "الْقَيُّومُ",
  "en": "Al-Qayyūm",
  "meaning ": "القائم بنفسه، الغني عن غيره، وهو القائم بتدبير أمر خلقه في إنشائهم ورزقهم."
 },
 {
  "nameOfAllah": "الوَاجِد",
  "en": "Al-Wājid",
  "meaning ": "لا يعوزه شيء ولا يعجزه شيء يجد كل ما يطلبه، ويدرك كل ما يريده."
 },
 {
  "nameOfAllah": "المَاجِد",
  "en": "Al-Mājid",
  "meaning ": "له الكمال المتناهي والعز الباهي، له العز في الأوصاف والأفعال الذي يعامل العباد بالجود والرحمة."
 },
 {
  "nameOfAllah": "الْوَاحِدُ",
  "en": "Al-Wāḥid",
  "meaning ": "الفرد المتفرد في ذاته وصفائه وأفعاله، واحد في ملكه لا ينازعه أحد، لا شريك له سبحانه."
 },
 {
  "nameOfAllah": "الأَحَد",
  "en": "Al-'Aḥad",
  "meaning ": "ليس معه غيره"
 },
 {
  "nameOfAllah": "الصَّمَدُ",
  "en": "Aṣ-Ṣamad",
  "meaning ": "المطاع الذي لا يقضى دونه أمر، الذي يقصد إليه في الحوائج فهو مقصد عباده في مهمات دينهم ودنياهم."
 },
 {
  "nameOfAllah": "الْقَادِرُ",
  "en": "Al-Qādir",
  "meaning ": "يقدر على إيجاد المعدوم وإعدام الموجود على قدر ما تقتضي الحكمة، لا زائدا عليه ولا ناقصا عنه."
 },
 {
  "nameOfAllah": "الْمُقْتَدِرُ",
  "en": "Al-Muqtadir",
  "meaning ": "يقدر على إصلاح الخلائق على وجه لا يقدر عليه غيره."
 },
 {
  "nameOfAllah": "الْمُقَدِّمُ",
  "en": "Al-Muqaddim",
  "meaning ": "يقدم الأشياء ويضعها في مواضعها، فمن استحق التقديم قدمه."
 },
 {
  "nameOfAllah": "الْمُؤَخِّرُ",
  "en": "Al-Mu'akhkhir",
  "meaning ": "يؤخر الأشياء فيضعها في مواضعها المؤخر لمن شاء من الفجار والكفار وكل من يستحق التأخير."
 },
 {
  "nameOfAllah": "الْأَوَّلُ",
  "en": "Al-'Awwal",
  "meaning ": "لم يسبقه في الوجود شيء فهو أول قبل الوجود."
 },
 {
  "nameOfAllah": "الْآخِرُ",
  "en": "Al-'Akhir",
  "meaning ": "الباقي بعد فناء خلقه، البقاء الأبدي يفنى الكل وله البقاء وحده، فليس بعده شيء."
 },
 {
  "nameOfAllah": "الظَّاهِرُ",
  "en": "Aẓ-Ẓāhir",
  "meaning ": "ظهر فوق كل شيء وعلا عليه، الظاهر وجوده لكثرة دلائله."
 },
 {
  "nameOfAllah": "الْبَاطِنُ",
  "en": "Al-Bāṭin",
  "meaning ": "العالم ببواطن الأمور وخفاياها، وهو أقرب إلينا من حبل الوريد."
 },
 {
  "nameOfAllah": "الوَالِي",
  "en": "Al-Wālīy",
  "meaning ": "المالك للأشياء المتصرف فيها بمشيئته وحكمته، ينفذ فيها أمره، ويجري عليها حكمه."
 },
 {
  "nameOfAllah": "الْمُتَعَالِ",
  "en": "Al-Muta'ālīy",
  "meaning ": "المنزه عن مشابهة خلقه. جل عن إفك المفترين، وتنزه عن وساوس المتحيرين."
 },
 {
  "nameOfAllah": "الْبِرُّ",
  "en": "Al-Barr",
  "meaning ": "كثير العطايا والإحسان. العطوف على عباده ببره ولطفه، ومن على السائلين بحسن عطائه، وهو الصدق فيما وعد."
 },
 {
  "nameOfAllah": "التَّوَّابُ",
  "en": "At-Tawwāb",
  "meaning ": "يوفق عباده للتوبة حتى يتوب عليهم ويقبل توبتهم فيقابل الدعاء بالعطاء، والتوبة بغفران الذنوب."
 },
 {
  "nameOfAllah": "الْمُنْتَقِمُ",
  "en": "Al-Muntaqim",
  "meaning ": "يقصم ظهور الطغاة، ويشدد العقوبة على العصاة، وذلك بعد الإعذار والإنذار."
 },
 {
  "nameOfAllah": "العَفُو",
  "en": "Al-'Afūw",
  "meaning ": "يعفو عمن يستغفره. يترك المؤاخدة على الذنوب ولا يذكرك بالعيوب فهو يمحو السيئات ويتجاوز عن المعاصي."
 },
 {
  "nameOfAllah": "الرَّؤُوفُ",
  "en": "Ar-Ra'ūf",
  "meaning ": "ذو رحمة ورأفة. المتعطف على المذنبين بالتوبة، الذي جاد بلطفه ومن بتعطفه، يستر العيوب ثم يعفو عنها."
 },
 {
  "nameOfAllah": "مَالِكُ الْمُلْكِ",
  "en": "Mālik-ul-Mulk",
  "meaning ": "المتصرف بملكه كيف يشاء لا راد لحكمه، ولا معقب لأمره."
 },
 {
  "nameOfAllah": "ذُو الْجَلَالِ والْإكْرَامِ",
  "en": "Dhū-l-Jalāli wa-l-'ikrām",
  "meaning ": "المنفرد بصفات الجلال والكمال والعظمة، المختص بالإكرام والكرامة وهو أهل لأن يجل."
 },
 {
  "nameOfAllah": "المُقسِّط",
  "en": "Al-Muqsiţ",
  "meaning ": "يعطي الحقوق لأصحابها. العادل في حكمه، الذي ينتصف للمظلوم من الظالم، ثم يكمل عدله فيرضي الظالم بعد إرضاء المظلوم."
 },
 {
  "nameOfAllah": "الْجَامِعُ",
  "en": "Al-Jāmi'",
  "meaning ": "جمع الكمالات كلها، ذاتا ووصفا وفعلا، الذي يجمع بين الخلائق المتماثلة والمتباينة، والذي يجمع الأولين والآخرين."
 },
 {
  "nameOfAllah": "الْغَنِيُّ",
  "en": "Al-Ghanīy",
  "meaning ": "ذاته غنية عن كافة الخلق. لا يحتاج إلى شيء، وهو المستغني عن كل ما سواه، المفتقر إليه كل من عاداه."
 },
 {
  "nameOfAllah": "المُغنِي",
  "en": "Al-Mughnīy",
  "meaning ": "المتفضل بإغناء سواه. معطي الغنى لعباده، يغني من يشاء غناه، وهو الكافي لمن شاء من عباده."
 },
 {
  "nameOfAllah": "المَانِع",
  "en": "Al-Māni'",
  "meaning ": "أعطى كل شيء، ويمنع العطاء عن من يشاء ابتلاء أو حماية."
 },
 {
  "nameOfAllah": "الضَّار",
  "en": "Aḍ-Ḍārr",
  "meaning ": "يغضب على العصاة. و المقدر للضر على من أراد كيف أراد."
 },
 {
  "nameOfAllah": "النَّافِع",
  "en": "An-Nāfi'",
  "meaning ": "ينتشر خيره في الوجود كله. المقدر النفع والخير لمن أراد كيف أراد كل ذلك على مقتضى حكمته سبحانه."
 },
 {
  "nameOfAllah": "النُّورُ",
  "en": "An-Nūr",
  "meaning ": "الهادي الرشيد الذي يرشد بهدايته من يشاء فيبين له الحق، ويلهمه اتباعه، الظاهر في ذاته، المظهر لغيره."
 },
 {
  "nameOfAllah": "الْهَادِي",
  "en": "Al-Hādīy",
  "meaning ": "المبين للخلق طريق الحق بكلامه يهدي القلوب إلى معرفته، والنفوس إلى طاعته."
 },
 {
  "nameOfAllah": "الْبَدِيعُ",
  "en": "Al-Badī'",
  "meaning ": "من يخلق كل شيء لا مثيل له ولا لجماله. لا يماثله أحد في صفاته ولا في حكم من أحكامه، أو أمر من أموره، فهو المحدث الموجد على غير مثال."
 },
 {
  "nameOfAllah": "الباقي",
  "en": "Al-Bāqīy",
  "meaning ": "وحده له البقاء، الدائم الوجود الموصوف بالبقاء الأزلي، غير قابل للفناء فهو الباقي بلا انتهاء."
 },
 {
  "nameOfAllah": "الْوَارِثُ",
  "en": "Al-Wārith",
  "meaning ": "الأبقى الدائم الذي يرث الخلائق بعد فناء الخلق، وهو يرث الأرض ومن عليها."
 },
 {
  "nameOfAllah": "الرَّشِيد",
  "en": "Ar-Rashīd",
  "meaning ": "أسعد من شاء بإرشاده، وأشقى من شاء بإبعاده، عظيم الحكمة بالغ الرشاد."
 },
 {
  "nameOfAllah": "الصَّبُور",
  "en": "Aṣ-Ṣabūr",
  "meaning ": "لا يتسرع في حكمه، ويملك حكمة تجاه كافة الأمور. الحليم الذي لا يعاجل العصاة بالنقمة، بل يعفوا ويؤخر."
 }
]
}