Repository: abdalrhmanreda/islamic-app
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: muslim
ar: مسلم

# onBoardingDescription1
source: The application can be a useful tool for Muslims who wish to practice their religious rituals in their daily lives.
ar: يمكن أن يكون التطبيق أداة مفيدة للمسلمين الذين يرغبون في ممارسة شعائرهم الدينية في حياتهم اليومية

# onBoardingDescription2
source: The application can be particularly helpful for Muslims living in areas where it may be difficult to find resources or local communities.
ar: يمكن أن يكون التطبيق مفيد بشكل خاص للمسلمين الذين يعيشون في مناطق قد يصعب فيها العثور على موارد أو مجتمعات محلية

# onBoardingDescription3
source: The program includes a Tasbeeh feature that allows you to count the number of Tasbeehs you perform.
ar: يحتوي البرنامج على خاصية التسبيح التي تمكن من إحصاء عدد التسبيحات التي تقوم بها

# onBoardingTextButtonText
source: Skip
ar: تخطى

# onBoardingButtonText
source: Next
ar: التالي

# enableLocationButtonText
source: Enable Location
ar: تمكين الموقع

# enableLocationDescription
source: Please grant permission to access your location
ar: يُرجى منح الإذن بالوصول إلى موقعك

# drawerContactUs
source: Contact Us
ar: تواصل معانا

# drawerTheme
source: Themes
ar: الثيمات

# drawerLanguage
source: Language
ar: اللغة

# drawerCenterHelp
source: Center Help
ar: مركز المساعدة

# drawerHeaderDescription
source: Talwa is an innovative and comprehensive Islamic app designed to cater to the needs of Muslims worldwide. With its diverse range of features, Talwa aims to provide users with a holistic Islamic experience, combining spirituality, education, community engagement, and convenience.
ar: تلاوة هو تطبيق إسلامي مبتكر وشامل مصمم لتلبية احتياجات المسلمين في جميع أنحاء العالم. بفضل مجموعته المتنوعة من الميزات، يهدف تالوا إلى توفير تجربة إسلامية شاملة للمستخدمين، مجمعًا بين الروحانية والتعليم والمشاركة المجتمعية والراحة.

# quranicButton
source: The Holy Quran
ar: القرآن الكريم

# explanationButton
source: Explanation
ar: تفسير

# praiseButton
source: Praise
ar: تسبيح

# prayersButton
source: Prayers
ar: أدعية

# hadithsButton
source: Hadiths
ar: أحاديث

# remembranceButton
source: Remembrance
ar: أذكار

# prayerTimingsButton
source: Prayer Timings
ar: مواقيت الصلاة

# hejriCalenderButton
source: Hejri Calender
ar: التقويم الهجري

# memorizingButton
source: Memorizing
ar: حفظ

# readingButton
source: Reading
ar: قراءة

source: The number of its verses
ar: عدد آياتها

# hadithTitle
source: Ahadith
ar: احاديث

source: Books Of Hadiths
ar: كتب الأحاديث

# hadithScreen
source: ' He, peace and blessings of God be upon him, said: “Whoever memorizes forty hadiths from my nation concerning matters of its religion, God will raise him on the Day of Resurrection to the group of jurists and scholars.” And in a narration, “And I will be for him on the Day of Resurrection as an intercessor and a witness.” Al-Nawawi, may God Almighty have mercy on him, said: (And it agreed to preserve its weakness, even if His ways are many)',
ar: 'قال صلى الله عليه وسلم: "من حفظ على أمتي أربعين حديثاً من أمر دينها، بعثه الله يوم القيامة في زمرة الفقهاء والعلماء" وفي رواية " وكنت له يوم القيامة شافعاً وشهيداً" قال النووي رحمه الله تعالى: (واتفق الحفاظ على ضعفه، وإن كثرت طرقه)',

source: Sahih Muslim
ar: صحيح مسلم

source: Sunan al-Tirmidhi
ar: سنن الترمذى

source: Muwatta Malik
ar: موطأ مالك

source: Musnad Ahmad ibn Hanbal
ar: مسند احمد بن حنبل

source: Sunan Abu Dawud
ar: سنن ابو داود

source: Sahih Bukhari
ar: صحيح البخارى

source: sunan Alnasayiyi
ar: سنن النسائي

source: Sunan Ibn Majah
ar: سنن ابن ماجه

# explanationScreenTitle
source: Interpretation of the Quran
ar: تفسير القرآن الكريم

# explanationScreen
source: 'The science of interpretation is one of the most honorable and noble sciences, the greatest blessing, the most extensive knowledge, and the nation's need for it is dire. God has honored the people of interpretation, raised their status, and made them a reference for His servants in understanding His words and knowing what He means, and that is sufficient grace and honor. The student’s knowledge is due to the knowledge of interpretation, his high status, and the majesty of his ability
ar: فإن علم التفسير من أشرف العلوم وأجلها، وأعظمها بركة، وأوسعها معرفة، وحاجة الأمة إليه ماسة، وقد شرف الله أهل التفسير ورفع مكانهم وجعلهم مرجعاً لعباده في فهم كلامه ومعرفة مراده وكفى بذلك فضلاً وشرفاً.

# tabeehButtonIncrease
source: Tasbeeh
ar: تسبيح

# tabeehButtonReturnAgain
source: repeat
ar: اعادة

# azkarTitle
source: Azkar
ar: أذكار

# azkarDescription
source: 'The remembrance necessitates the prayers of God Almighty and His angels upon the one who remembers, and whoever God Almighty and His angels send blessings upon him has achieved all success and achieved all success. God Almighty said: (O you who have believed, remember God often and glorify Him morning and evening. It is He who sends blessings upon you and His angels to bring you out of darkness into light. And He was merciful to the believers.)
ar: الذكر يوجب صلاة الله عز وجل وملائكته على الذاكر ومن صلى الله تعالى عليه وملائكته فقد افلح كل الفلاح وفاز كل الفوز قال سبحانه وتعالى : ( يا أيها الذين امنوا اذكروا الله ذكرا كثيرا و سبحوه بكرة وأصيلا هو الذي يصلى عليكم وملائكته ليخرجكم من الظلمات إلى النور وكان بالمؤمنين رحيما )

# azkarMoringButton
source: Azkar for morning
ar: أذكار الصباح

# azkarNightButton
source: Azkar for night
ar: أذكار المساء

# azkarSleepingButton
source: Azkar for sleeping
ar: أذكار النوم

# azkarWakeUpButton
source: Azkar for wake up
ar: أذكار الاستيقاظ

# azkarAfterPreyButton
source: Azkar after prey
ar: أذكار بعد الصلاة

# someHadisFromSeer1
source: Some Hadis From The Book Of
ar: بعض الأحاديث من كتاب

# mailkBrief
source: Imam Malik was born in Medina in the year 93 AH, and he grew up in a house that was preoccupied with the science of hadith, researching narrations, and the news of the Companions and their fatwas. He memorized the Holy Qur’an early in his life, then he turned to memorizing the Prophet’s hadith and learning Islamic jurisprudence. He stayed with the jurist of Medina, Ibn Hurmuz, to learn with him for seven years.’
ar: وُلد الإمام مالك بالمدينة المنورة سنة 93هـ، ونشأ في بيت كان مشتغلاً بعلم الحديث واستطلاع الآثار وأخبار الصحابة وفتاويهم، فحفظ القرآن الكريم في صدر حياته، ثم اتجه إلى حفظ الحديث النبوي وتعلُّمِ الفقه الإسلامي، فلازم فقيه المدينة المنورة ابن هرمز سبع سنين يتعلم عنده

# ahmedBrief
source: He was famous for his abundant knowledge and strong memorization, and he was known for good morals such as patience, humility, and tolerance. Many scholars praised him, including Imam al-Shafi’i, saying: “I left Baghdad and did not leave behind anyone more pious, pious, or knowledgeable than Ahmad ibn Hanbal,” and his book “Al-Musnad” is considered One of the most famous and extensive books of hadith.
ar: اشتُهر بعلمه الغزير وحفظه القوي، وكان معروفاً بالأخلاق الحسنة كالصبر والتواضع والتسامح، وقد أثنى عليه كثير من العلماء منهم الإمام الشافعي بقوله: «خرجتُ من بغداد وما خلَّفتُ بها أحداً أورع ولا أتقى ولا أفقه من أحمد بن حنبل»، ويُعدُّ كتابه «المسند» من أشهر كتب الحديث وأوسعها.

# tirmidziBrief
source: Al-Tirmidhi was born in the first decade of the third century AH, around the year 210 AH, and Saladin Al-Safadi said: He was born in the year two hundred, and Ibn Al-Atheer Al-Jazari said: He was born in the year 209 AH. He was born in Tirmidh, and he is attributed to it. Tirmidh is a great and spacious city in Khurasan, and Ibn al-Atheer said: In Balkh, on the outskirts of the Oxus. It was said that he was born in the village of Bug, which is located six farsakhs from Tirmidh.
ar: ولد الترمذي في العقد الأول من القرن الثالث الهجري، في حدود سنة 210 هـ، وقال صلاح الدين الصفدي: ولد سنة بضع ومائتين، وقال ابن الأثير الجزري: ولد سنة 209 هـ. ولد في ترمذ وإليها يُنسب، وترمذ مدينة عظيمة واسعة بخراسان، وقال ابن الأثير: ببلخ، على طرف جيحون. وقيل بل ولد في قرية بُوغ التي تقع على بعد ستة فراسخ من ترمذ.

# muslimBrief
source: Abu Al-Hussein Muslim bin Al-Hajjaj bin Muslim bin Ward bin Kushaz Al-Qushayri Al-Naysaburi (206 AH - 25 Rajab 261 AH) / (822 AD - 6 July 875 AD) is one of the most important scholars of the Prophet’s hadith according to the Sunnis and the community. He is the compiler of the book Sahih Muslim, which is considered the second The most authentic hadith book after Sahih al-Bukhari. He is one of the great memorizers. He was born in Nishapur. He sought hadith from a young age.
ar: أبو الحسين مسلم بن الحجاج بن مسلم بن وَرْدٍ بن كوشاذ القشيري النيسابوري (206 هـ - 25 رجب 261 هـ) / (822م - 6 يوليو 875م)، هو من أهم علماء الحديث النبوي عند أهل السنة والجماعة، وهو مصنف كتاب صحيح مسلم الذي يعتبر ثاني أصح كتب الحديث بعد صحيح البخاري، وهو أحد كبار الحفّاظ، ولد في نيسابور، طلب الحديث صغيرًا

# abuDawadBrief
source: Abu Dawud mentioned that he collected about 5,300 hadiths in his Sunan. Abu Dawud paid attention to the hadiths about the rulings that the jurists used as evidence, and on which the Egyptian scholars based their jurisprudential rulings. He said in his letter to the people of Mecca: “These hadiths are all the hadiths of the Sunnah regarding rulings. As for many hadiths about asceticism and virtues, And others other than this, but I did not publish them.” He divided his book into 36 books
ar: ذكر أبو داود أنه جمع في سننه حوالي 5300 حديثًا، اهتم أبو داود بأحاديث الأحكام التي استدل بها الفقهاء، وبنى عليها علماءُ الأمصار الأحكامَ الفقهية، حيث قال في رسالته لأهل مكة: «فهذه الأحاديث أحاديث السنن كلها في الأحكام، فأما أحاديث كثيرة في الزهد والفضائل، وغيرها من غير هذا فلم أخرجها.»، وقد قسّم كتابه إلى 36 كتابًا

# bukhariBrief
source: Al-Bukhari was born in Bukhara, one of the cities of present-day Uzbekistan, in the year 194 AH (corresponding to 810 AD). He gained his position due to his collection of the Prophet’s hadith and his classification of the most important book in it, which the Sunnis rely on fundamentally in all their lives and consider it the most complete and comprehensive book of the Prophet’s biography.
ar: البخارى، ولد فى بخارى إحدى مدن أوزبكستان الحالية عام 194 هجرية (الموافق 810م)، وحصل على مكانته بسبب جمعه للحديث النبوى، وتصنيفه لأهم كتاب فيه والذى يعتمد عليه أهل السنة بصورة أساسية فى كل حياتهم ويعتبرونه الكتاب الأتم والأشمل للسيرة النبوية

# ibnMagahBrief
source: Abu Abdullah Muhammad bin Yazid bin Majah al-Rubi’i (in loyalty) al-Qazwini (209 AH - 824 AD / 273 AH - 886 AD) is a Muslim hadith scholar, interpreter, and historian, and one of the imams in the science of hadith. From the people of Qazvin, he was born and died there. He traveled to Basra, Baghdad, the Levant, Egypt, Mecca, Medina, and Rayy, seeking hadith. He classified his book (Sunan Ibn Majah)
ar: أبو عبد الله محمد بن يزيد بن ماجه الربعي (بالولاء) القزويني (209 هـ - 824م / 273 هـ - 886م) هو محدِّث ومفسر ومؤرخ مسلم، وأحد الأئمة في علم الحديث. من أهل قزوين، مولده ووفاته فيها. رحل إلى البصرة وبغداد والشام ومصر ومكة والمدينة والري، في طلب الحديث. وصنف كتابه (سنن ابن ماجه)

# nsaiBrief
source: Abu Abd al-Rahman Ahmad bin Shuaib bin Ali bin Sinan bin Bahr bin Dinar al-Nasa’i (215 AH - 303 AH), (829 AD - 915 AD) a hadith scholar and judge, and one of the imams of the noble Prophetic hadith, the author of the minor and major Sunans, known as Sunan al-Nasa’i, born in the year 215 AH. In the ancient town of Nisa in Khorasan, currently located in Turkmenistan, he sought knowledge and hadith when he was young
ar: أبو عبد الرحمن أحمد بن شعيب بن علي بن سنان بن بحر بن دينار النَّسائي (215 هـ - 303 هـ)، (829م - 915م) محدِث وقاضٍ، وأحد أئمة الحديث النبوي الشريف، صاحب السنن الصغرى والكبرى، المعروف بسنن النسائي، ولد سنة 215 هـ في بلدة نسا من بلاد خراسان قديمًا وتقع في تركمانستان حاليًا، وطلب العلم والحديث وهو صغير

# prayerQuranic
source: Quranic Prayers
ar: أدعية قرآنية

# prayerNabwi
source: Prayers of the Prophets
ar: أدعية الأنبياء

# prayerPary
source: Prayers for prayer
ar: أدعية للصلاة

# prayerDead
source: Prayers for the dead
ar: أدعية للميت

# prayerTraveling
source: Prayers for travel
ar: أدعية للسفر

# prayerFood
source: Prayers for food
ar: أدعية للطعام

# prayerMiscellaneous
source: various Prayers
ar: أدعية متنوعة

source: Qibla
ar: القبلة

# homeContainerTitle
source: The call to prayer is announced at exactly the same time
ar: الصلاة القادمه

source: On Time
ar: الساعة

source: Fajr
ar: الفجر

source: Dhuhr
ar: الظهر

source: Asr
ar: العصر

source: Maghrib
ar: المغرب

source: Isha
ar: العشاء

source: Shuruq
ar: الشروق

source: Save Aya
ar: حفظ الآية

source: Save Hadith
ar: حفظ الحديث

source: Listen To Aya
ar: الاستماع للآية

source: Still In Time
ar: متبقي من الوقت

source: Often
ar: مرة

source: Ahadith Books
ar: كتب الأحاديث

source: Imam Bukhari
ar: الإمام البخاري

source: Imam Muslim
ar: الإمام مسلم

source: Imam Abu Dawood
ar: الإمام أبو داود

source: Imam Tirmidhi
ar: الإمام الترمذي

source: Imam Nasa'i
ar: الإمام النسائي

source: Imam Ibn Majah
ar: الإمام ابن ماجه

source: Imam Malik
ar: الإمام مالك

source: Imam Ahmad ibn Hanbal
ar: الإمام أحمد بن حنبل

source: Wait Ahadith Loading
ar: جاري تحميل الأحاديث

# thereErrorDuringLoading
source: There is an error during loading
ar: حدث خطأ أثناء التحميل , يرجى المحاولة مرة أخرى

source: Book
ar: كتاب

# imam1
source: Imam Muhammad ibn Isma'il al-Bukhari was born in Bukhara, Uzbekistan in 194 AH (810 CE). He is renowned for his compilation of Prophetic hadiths, particularly his work that is fundamental to Sunni Islam, relied upon throughout their lives as the most comprehensive book on the Prophet's biography.
ar: الإمام محمد بن إسماعيل البخاري، ولد في بخارى إحدى مدن أوزبكستان الحالية عام 194 هجرية (الموافق 810م)، وحصل على مكانته بسبب جمعه للحديث النبوي وتصنيفه لأهم كتاب فيه، الذي يعتمد عليه أهل السنة بصورة أساسية في كل حياتهم ويعتبرونه الكتاب الأتم والأشمل للسيرة النبوية.

# imam2
source: Imam Muslim ibn al-Hajjaj was one of the foremost scholars of Prophetic hadith among Sunni Muslims. He authored Sahih Muslim, considered the second most authentic compilation of hadiths after Sahih al-Bukhari.
ar: الإمام مسلم بن الحجاج بن مسلم بن وَرْدٍ بن كوشاذ القشيري النيسابوري (206 هـ - 261 هـ / 822م - 875م)، هو من أهم علماء الحديث النبوي عند أهل السنة والجماعة، وهو مصنف كتاب صحيح مسلم الذي يعتبر ثاني أصح كتب الحديث بعد صحيح البخاري.

# imam3
source: Imam Abu 'Isa Muhammad al-Tirmidhi was born in the early third century AH in Tirmidh, which is located in Khorasan. He was a prominent scholar of Prophetic hadith.
ar: الإمام أبو عيسى محمد الترمذي، وُلد في العقد الأول من القرن الثالث الهجري، في ترمذ، وإليها يُنسب، وترمذ مدينة عظيمة واسعة بخراسان. وكان من أبرز العلماء في علم الحديث النبوي الشريف.

# imam4
source: Imam Abu Dawood compiled around 5300 hadiths in his Sunan. He focused on hadiths related to legal rulings used by jurists, categorizing his book into 36 sections covering various aspects of Islamic jurisprudence.
ar: الإمام أبو داود، ذكر أنه جمع في سننه حوالي 5300 حديثًا، واهتم بأحاديث الأحكام التي استدل بها الفقهاء، وقسم كتابه إلى 36 كتابًا يتضمنون مختلف الأحكام الشرعية.

# imam5
source: Imam Ahmad ibn Shuaib al-Nasa'i was a scholar and judge known for his Sunan al-Sughra and Sunan al-Kubra, collectively referred to as Sunan al-Nasa'i. He was born in the town of Nasa in ancient Khorasan and sought knowledge and hadith from a young age.
ar: الإمام أحمد بن شعيب النسائي، محدِّث وقاضٍ، وأحد أئمة الحديث النبوي الشريف، صاحب السنن الصغرى والكبرى، المعروف بسنن النسائي. وُلد في بلدة نسا من بلاد خراسان قديمًا وطلب العلم والحديث وهو صغير.

# imam6
source: Imam Muhammad ibn Yazid al-Qazwini al-Rabi' was a Muslim scholar, commentator, and historian known for his work in the field of hadith. He authored Sunan ibn Majah, one of the six major books of hadith in Sunni Islam.
ar: الإمام محمد بن يزيد بن ماجه الربعي القزويني، محدِّث ومفسر ومؤرخ مسلم، وأحد الأئمة في علم الحديث. صنف كتابه سنن ابن ماجه الذي يعتبر من الكتب الستة الكبار في الحديث الإسلامي.

# imam7
source: Imam Malik ibn Anas was born in Medina in 93 AH and grew up in a household deeply involved in hadith studies, jurisprudence, and the traditions of the Companions. He was known for his piety, righteousness, and deep understanding of Islamic law.
ar: الإمام مالك بن أنس، وُلد في المدينة المنورة سنة 93هـ، ونشأ في بيت كان مشتغلاً بعلم الحديث واستطلاع الآثار وأخبار الصحابة وفتاويهم. وُصِف بالورع والتقوى والفقه العميق في الشريعة الإسلامية.

# imam8
source: Imam Ahmad ibn Hanbal was renowned for his extensive knowledge and strong memory. He was also known for his exemplary character traits such as patience, humility, and tolerance. His work, Musnad Ahmad, is one of the most famous and comprehensive books of hadith.
ar: الإمام أحمد بن حنبل، اشتُهر بعلمه الغزير وحفظه القوي، وكان معروفاً بالأخلاق الحسنة كالصبر والتواضع والتسامح. يُعتبر كتابه المسند من أشهر كتب الحديث وأوسعها.

# forMoreInformation
source: For More Information about
ar: لمزيد من المعلومات عن

source: Click Here
ar: اضغط هنا

source: Number of Hadiths
ar: رقم الحديث

source: Verse Copied To Clipboard
ar: تم نسخ الآية إلى الحافظة

source: Madinuh
ar: مدنية

source: Play
ar: تشغيل

source: Surah
ar: سورة

source: Share
ar: مشاركة

source: Powered By Muslim App
ar: مدعوم بواسطة تطبيق مسلم

source: Wait Azkar Loading
ar: جاري تحميل الأذكار

source: Copy Zaker In Clipboard
ar: تم نسخ الذكر إلى الحافظة

source: Favorite
ar: المفضلة

source: Surahs
ar: السور

# juz
source: Juzs
ar: الجزء

source: Font Sizes
ar: حجم الخط

source: Small
ar: صغير

source: Medium
ar: متوسط

source: Large
ar: كبير

# searchBySurahAndNumber
source: Search By Surah
ar: ابحث بالسورة

source: Search By Juz
ar: ابحث بالجزء

# aljuz
source: Juz
ar: الجزء

source: Prayers
ar: الأدعية

source: Wait Prayers Loading
ar: جاري تحميل الأدعية

source: Prayer For Prayer
ar: أدعية للصلاة

source: Prayer For Dead
ar: أدعية للميت

source: Prayer For Traveling
ar: أدعية للسفر

source: Prayer For Food
ar: أدعية للطعام

source: Prayer For Miscellaneous
ar: أدعية متنوعة

source: Prayer Copy To Clipboard
ar: تم نسخ الدعاء إلى الحافظة

source: Choose Reciter
ar: اختر القارئ

source: Names Of Allah
ar: أسماء الله الحسنى

source: Audio
ar: الصوتيات

source: Quran
ar: القرآن الكريم

source: Radio
ar: الاذاعة

source: Available Surahs For
ar: السور المتاحة للقارئ

# info
source: about app
ar: حول التطبيق

source: No Internet Connection
ar: لا يوجد اتصال بالإنترنت

source: Waiting Loading Surah Tafseer
ar: جاري تحميل تفسير السورة

source: Copy Text In Clipboard
ar: تم نسخ النص إلى الحافظة

source: Search For Favorite Reciter
ar: ابحث عن قارئك المفضل

source: No Reciter Found
ar: لم يتم العثور على قارئ

source: Error Happened
ar: حدث خطأ

source: Share App
ar: مشاركة التطبيق

# shareAppDescription
source: Share the app with your friends and family
ar: تطبيق مسلم هو تطبيق إسلامي مبتكر وشامل مصمم لتلبية احتياجات المسلمين في جميع أنحاء العالم. بفضل مجموعته المتنوعة من الميزات، يهدف تالوا إلى توفير تجربة إسلامية شاملة للمستخدمين، مجمعًا بين الروحانية والتعليم والمشاركة المجتمعية والراحة.

source: Rate App
ar: تقييم التطبيق

# contectWithDeveloper
source: Contact With Developer
ar: للتواصل مع المطور

source: Search With Page Number Or Surah Name Or Aya
ar: ابحث باسم السورة

source: Loading Books
ar: جاري تحميل الكتب

source: Features
ar: الميزات

# calendar
source: hejri calender
ar: التقويم الهجري

# rookie
source: Rokia
ar: الرقية الشرعية

# wardPraise
source: الدعية الواردة
ar: السنة النبوية

# rookiaCopyToClipboard
source: Copy To Clipboard
ar: تم نسخ الرقية إلى الحافظة

source: Zakat
ar: زكاتك

# zakatk
source: Zakat
ar: الزكاة فريضة فرضها الله على أغنياء المسلمين ترد على فقرائهم كما قلنا، ومع أنها طاعة لله واستجابة إلا أنها مع ذلك فيها فؤائد كثيرة ومنافع كبيرة ومصالح وفيرة

source: Money Zakat
ar: زكاة المال

source: Gold Zakat
ar: زكاة الذهب

source: Silver Zakat
ar: زكاة الفضة
